docs/Developer/classDiagrams.md
```mermaid
%%{init: {'class': {'hideEmptyMembersBox': true}}}%%
classDiagram
class All911Edges {
    +vector~ unsigned char ~ isAvailable_
    +vector~ unsigned char ~ isRedial_
    +vector~ Call ~ call_
    +setupEdges() override
    +createEdge(...)
    +allocEdgeDeviceStruct() override
    +allocEdgeDeviceStruct(...)
    +deleteEdgeDeviceStruct() override
    +copyEdgeHostToDevice() override
    +copyEdgeHostToDevice(...)
    +copyEdgeDeviceToHost() override
    +copyDeviceEdgeCountsToHost(void *allEdgesDevice) override
    +advanceEdges(...)
    +setAdvanceEdgesDeviceParams() override
    +printGPUEdgesProps(void *allEdgesDeviceProps) const override
    +advanceEdges(...)
    +advance911Edge(BGSIZE iEdg, All911Vertices &vertices)
    +advanceEdge(BGSIZE iEdg, AllVertices &vertices) override
    +Create()$ AllEdges *
    #allocDeviceStruct(...)
    #deleteDeviceStruct(All911EdgesDeviceProperties &allEdgesDeviceProps)
    #copyHostToDevice(...)
    #copyDeviceToHost(All911EdgesDeviceProperties &allEdgesDeviceProps)
}
class AllDSSynapses {
    +vector~ uint64_t ~ lastSpike_
    +vector~ BGFLOAT ~ r_
    +vector~ BGFLOAT ~ u_
    +vector~ BGFLOAT ~ D_
    +vector~ BGFLOAT ~ U_
    +vector~ BGFLOAT ~ F_
    +setupEdges() override
    +resetEdge(BGSIZE iEdg, BGFLOAT deltaT) override
    +printParameters() const override
    +createEdge(...)
    +printSynapsesProps() const override
    +serialize(Archive &archive)
    +allocEdgeDeviceStruct() override
    +allocEdgeDeviceStruct(...)
    +deleteEdgeDeviceStruct() override
    +copyEdgeHostToDevice() override
    +copyEdgeHostToDevice(...)
    +copyEdgeDeviceToHost() override
    +setEdgeClassID() override
    +printGPUEdgesProps(void *allEdgesDeviceProps) const override
    +Create()$ AllEdges *
    #setupEdges(int numVertices, int maxEdges) override
    #readEdge(istream &input, BGSIZE iEdg) override
    #writeEdge(ostream &output, BGSIZE iEdg) const override
    #allocDeviceStruct(...)
    #deleteDeviceStruct(...)
    #copyHostToDevice(...)
    #copyDeviceToHost(...)
    #changePSR(BGSIZE iEdg, BGFLOAT deltaT) override
}
class AllDynamicSTDPSynapses {
    +vector~ uint64_t ~ lastSpike_
    +vector~ BGFLOAT ~ r_
    +vector~ BGFLOAT ~ u_
    +vector~ BGFLOAT ~ D_
    +vector~ BGFLOAT ~ U_
    +vector~ BGFLOAT ~ F_
    +setupEdges() override
    +resetEdge(BGSIZE iEdg, BGFLOAT deltaT) override
    +printParameters() const override
    +createEdge(...)
    +printSynapsesProps() const override
    +serialize(Archive &archive)
    +allocEdgeDeviceStruct() override
    +allocEdgeDeviceStruct(...)
    +deleteEdgeDeviceStruct() override
    +copyEdgeHostToDevice() override
    +copyEdgeHostToDevice(...)
    +copyEdgeDeviceToHost() override
    +setEdgeClassID() override
    +printGPUEdgesProps(void *allEdgesDeviceProps) const override
    +Create()$ AllEdges *
    #setupEdges(int numVertices, int maxEdges) override
    #readEdge(istream &input, BGSIZE iEdg) override
    #writeEdge(ostream &output, BGSIZE iEdg) const override
    #allocDeviceStruct(...)
    #deleteDeviceStruct(...)
    #copyHostToDevice(...)
    #copyDeviceToHost(...)
    #changePSR(BGSIZE iEdg, BGFLOAT deltaT)
}
class AllEdges {
    <<abstract>>
    #log4cplus::Logger fileLogger_
    #log4cplus::Logger edgeLogger_
    +vector~ int ~ sourceVertexIndex_
    +vector~ int ~ destVertexIndex_
    +vector~ BGFLOAT ~ W_
    +vector~ edgeType ~ type_
    +vector~ unsigned char ~ inUse_
    +vector~ BGSIZE ~ edgeCounts_
    +setupEdges()
    +loadParameters()
    +printParameters() const
    +addEdge(...) BGSIZE
    +createEdge(...)*
    +createEdgeIndexMap(EdgeIndexMap &edgeIndexMap)
    +serialize(Archive &archive)
    +allocEdgeDeviceStruct()=0*
    +allocEdgeDeviceStruct(...)*
    +deleteEdgeDeviceStruct()=0*
    +copyEdgeHostToDevice()=0*
    +copyEdgeHostToDevice(...)*
    +copyEdgeDeviceToHost()=0*
    +copyDeviceEdgeCountsToHost(void *allEdgesDevice)=0*
    +advanceEdges(...)*
    +setAdvanceEdgesDeviceParams()=0*
    +printGPUEdgesProps(void *allEdgesDeviceProps) const =0*
    +advanceEdges(...)
    +advanceEdge(BGSIZE iEdg, AllVertices &vertices)=0*
    +eraseEdge(int vertexIndex, BGSIZE iEdg)
    #setupEdges(int numVertices, int maxEdges)
    #readEdge(istream &input, BGSIZE iEdg)
    #writeEdge(ostream &output, BGSIZE iEdg) const
    #edgeOrdinalToType(int typeOrdinal) edgeType
}
class AllNeuroEdges {
    <<abstract>>
    +vector~ BGFLOAT ~ psr_
    +setupEdges() override
    +resetEdge(BGSIZE iEdg, BGFLOAT deltaT)
    +edgSign(const edgeType type) int
    +printSynapsesProps() const
    +serialize(Archive &archive)
    +outputWeights(int epochNum)=0*
    +setEdgeClassID()=0*
    #setupEdges(int numVertices, int maxEdges) override
    #readEdge(istream &input, BGSIZE iEdg) override
    #writeEdge(ostream &output, BGSIZE iEdg) const override
}
class AllSpikingSynapses {
    +vector~ BGFLOAT ~ decay_
    +vector~ BGFLOAT ~ tau_
    +vector~ int ~ totalDelay_
    +vector~ uint32_t ~ delayQueue_
    +vector~ int ~ delayIndex_
    +vector~ int ~ delayQueueLength_
    +setupEdges() override
    +resetEdge(BGSIZE iEdg, BGFLOAT deltaT) override
    +loadParameters() override
    +printParameters() const override
    +createEdge(...)
    +allowBackPropagation() bool
    +printSynapsesProps() const
    +serialize(Archive &archive)
    +outputWeights(int epochNum)
    +allocEdgeDeviceStruct() override
    +allocEdgeDeviceStruct(...)
    +deleteEdgeDeviceStruct() override
    +copyEdgeHostToDevice() override
    +copyEdgeHostToDevice(...)
    +copyEdgeDeviceToHost() override
    +copyDeviceEdgeCountsToHost(void *allEdgesDevice) override
    +advanceEdges(...)
    +setAdvanceEdgesDeviceParams() override
    +setEdgeClassID() override
    +printGPUEdgesProps(void *allEdgesDeviceProps) const override
    +copyDeviceEdgeSumIdxToHost(void *allEdgesDevice)
    +copyDeviceEdgeWeightsToHost(void *allEdgesDevice)
    +advanceEdge(BGSIZE iEdg, AllVertices &neurons) override
    +preSpikeHit(BGSIZE iEdg)
    +postSpikeHit(BGSIZE iEdg)
    +Create()$ AllEdges *
    #setupEdges(int numVertices, int maxEdges)
    #initSpikeQueue(BGSIZE iEdg)
    #updateDecay(BGSIZE iEdg, BGFLOAT deltaT) bool
    #readEdge(istream &input, BGSIZE iEdg) override
    #writeEdge(ostream &output, BGSIZE iEdg) const override
    #allocDeviceStruct(...)
    #deleteDeviceStruct(...)
    #copyHostToDevice(...)
    #copyDeviceToHost(...)
    #isSpikeQueue(BGSIZE iEdg) bool
    #changePSR(BGSIZE iEdg, BGFLOAT deltaT)
}
class AllSTDPSynapses {
    +vector~ int ~ totalDelayPost_
    +vector~ uint32_t ~ delayQueuePost_
    +vector~ int ~ delayIndexPost_
    +vector~ int ~ delayQueuePostLength_
    +vector~ BGFLOAT ~ tauspost_
    +vector~ BGFLOAT ~ tauspre_
    +vector~ BGFLOAT ~ taupos_
    +vector~ BGFLOAT ~ tauneg_
    +vector~ BGFLOAT ~ STDPgap_
    +vector~ BGFLOAT ~ Wex_
    +vector~ BGFLOAT ~ Aneg_
    +vector~ BGFLOAT ~ Apos_
    +vector~ BGFLOAT ~ mupos_
    +vector~ BGFLOAT ~ muneg_
    +setupEdges() override
    +resetEdge(BGSIZE iEdg, BGFLOAT deltaT) override
    +allowBackPropagation() override bool
    +loadParameters() override
    +printParameters() const override
    +createEdge(...)
    +printSynapsesProps() const override
    +serialize(Archive &archive)
    +allocEdgeDeviceStruct() override
    +allocEdgeDeviceStruct(...)
    +deleteEdgeDeviceStruct() override
    +copyEdgeHostToDevice() override
    +copyEdgeHostToDevice(...)
    +copyEdgeDeviceToHost() override
    +advanceEdges(...)
    +setEdgeClassID() override
    +printGPUEdgesProps(void *allEdgesDeviceProps) const override
    +advanceEdge(BGSIZE iEdg, AllVertices &neurons) override
    +postSpikeHit(BGSIZE iEdg) override
    +Create()$ AllEdges *
    #setupEdges(int numVertices, int maxEdges) override
    #readEdge(istream &input, BGSIZE iEdg) override
    #writeEdge(ostream &output, BGSIZE iEdg) const override
    #initSpikeQueue(BGSIZE iEdg) override
    #allocDeviceStruct(...)
    #deleteDeviceStruct(AllSTDPSynapsesDeviceProperties &allEdgesDevice)
    #copyHostToDevice(...)
    #copyDeviceToHost(AllSTDPSynapsesDeviceProperties &allEdgesDevice)
    #isSpikeQueuePost(BGSIZE iEdg) bool
    #synapticWeightModification(BGSIZE iEdg, BGFLOAT edgeWeight, double delta) BGFLOAT
    -stdpLearning(...)
}
AllEdges <|-- All911Edges
AllSpikingSynapses <|-- AllDSSynapses
AllSTDPSynapses <|-- AllDynamicSTDPSynapses
AllEdges <|-- AllNeuroEdges
AllNeuroEdges <|-- AllSpikingSynapses
AllSpikingSynapses <|-- AllSTDPSynapses
```
