docs/Developer/classDiagrams.md
```mermaid
%%{init: {'class': {'hideEmptyMembersBox': true}}}%%
classDiagram
class All911Vertices {
    +vector~ int ~ vertexType_
    +vector~ EventBuffer~ uint64_t ~ ~ beginTimeHistory_
    +vector~ EventBuffer~ uint64_t ~ ~ answerTimeHistory_
    +vector~ EventBuffer~ uint64_t ~ ~ endTimeHistory_
    +vector~ EventBuffer~ uint64_t ~ ~ wasAbandonedHistory_
    +vector~ EventBuffer~ uint64_t ~ ~ queueLengthHistory_
    +vector~ EventBuffer~ float ~ ~ utilizationHistory_
    +vector~ CircularBuffer~ Call ~ ~ vertexQueues_
    +RecordableVector~ int ~ droppedCalls_
    +RecordableVector~ int ~ receivedCalls_
    +vector~ int ~ busyServers_
    +RecordableVector~ int ~ numServers_
    +RecordableVector~ int ~ numTrunks_
    +vector~ vector~ Call ~ ~ servingCall_
    +vector~ vector~ uint64_t ~ ~ answerTime_
    +vector~ vector~ int ~ ~ serverCountdown_
    +InputManager~ Call ~ inputManager_
    +vector~ int ~ vertexIdToNoiseIndex_
    +setupVertices() override
    +createAllVertices(Layout &layout)
    +loadParameters()
    +printParameters() const override
    +toString(int index) const string
    +loadEpochInputsToVertices(uint64_t currentStep, uint64_t endStep) override
    +registerHistoryVariables() override
    +getQueue(int vIdx) CircularBuffer~ Call ~ &
    +droppedCalls(int vIdx) int &
    +receivedCalls(int vIdx) int &
    +busyServers(int vIdx) const int
    +allocVerticesDeviceStruct() override
    +deleteVerticesDeviceStruct() override
    +copyToDevice() override
    +copyFromDevice() override
    +advanceVertices(...)
    +setAdvanceVerticesDeviceParams(AllEdges &edges) override
    +clearVertexHistory(void *allVerticesDevice) override
    +integrateVertexInputs(...)
    +copyEpochInputsToDevice() override
    +getNumberOfVerticesNeedingDeviceNoise() const override int
    +advanceVertices(...)
    +integrateVertexInputs(...)
    +Create()$ AllVertices *
    #getEdgeToClosestResponder(const Call &call, BGSIZE vertexIdx) BGSIZE
    #allocDeviceStruct(...)
    #deleteDeviceStruct(...)
    #copyVertexQueuesToDevice(...)
    #copyVertexQueuesFromDevice(...)
    #copyServingCallToDevice(...)
    #copyServingCallFromDevice(...)
    -advanceCALR(...)
    -advancePSAP(...)
    -advanceRESP(...)
}
class AllIFNeurons {
    +DeviceVector~ BGFLOAT ~ Trefract_
    +DeviceVector~ BGFLOAT ~ Vthresh_
    +DeviceVector~ BGFLOAT ~ Vrest_
    +DeviceVector~ BGFLOAT ~ Vreset_
    +DeviceVector~ BGFLOAT ~ Vinit_
    +DeviceVector~ BGFLOAT ~ Cm_
    +DeviceVector~ BGFLOAT ~ Rm_
    +DeviceVector~ BGFLOAT ~ Inoise_
    +DeviceVector~ BGFLOAT ~ Iinject_
    +DeviceVector~ BGFLOAT ~ Isyn_
    +DeviceVector~ int ~ numStepsInRefractoryPeriod_
    +DeviceVector~ BGFLOAT ~ C1_
    +DeviceVector~ BGFLOAT ~ C2_
    +DeviceVector~ BGFLOAT ~ I0_
    +DeviceVector~ BGFLOAT ~ Vm_
    +DeviceVector~ BGFLOAT ~ Tau_
    +setupVertices() override
    +loadParameters()
    +printParameters() const
    +createAllVertices(Layout &layout)
    +toString(int index) const string
    +deserialize(istream &input)
    +serialize(ostream &output) const
    +serialize(Archive &archive)
    +advanceVertices(...)
    +allocVerticesDeviceStruct()
    +deleteVerticesDeviceStruct()
    +clearVertexHistory(void *allVerticesDevice) override
    +copyFromDevice() override
    +copyToDevice() override
    #allocDeviceStruct(AllIFNeuronsDeviceProperties &allVerticesDevice)
    #deleteDeviceStruct(AllIFNeuronsDeviceProperties &allVerticesDevice)
    #copyDeviceToHost(AllIFNeuronsDeviceProperties &allVerticesDevice)
    #createNeuron(int neuronIndex, Layout &layout)
    #setNeuronDefaults(int index)
    #initNeuronConstsFromParamValues(int neuronIndex, BGFLOAT deltaT)
    #readNeuron(istream &input, int i)
    #writeNeuron(ostream &output, int i) const
}
class AllIZHNeurons {
    +DeviceVector~ BGFLOAT ~ Aconst_
    +DeviceVector~ BGFLOAT ~ Bconst_
    +DeviceVector~ BGFLOAT ~ Cconst_
    +DeviceVector~ BGFLOAT ~ Dconst_
    +DeviceVector~ BGFLOAT ~ u_
    +DeviceVector~ BGFLOAT ~ C3_
    +setupVertices() override
    +printParameters() const override
    +createAllVertices(Layout &layout) override
    +toString(int index) const override string
    +deserialize(istream &input) override
    +serialize(ostream &output) const override
    +serialize(Archive &archive)
    +advanceVertices(...)
    +allocVerticesDeviceStruct() override
    +deleteVerticesDeviceStruct() override
    +clearVertexHistory(void *allVerticesDevice) override
    +copyFromDevice() override
    +copyToDevice() override
    +Create()$ AllVertices *
    #allocDeviceStruct(AllIZHNeuronsDeviceProperties &allVerticesDevice)
    #deleteDeviceStruct(AllIZHNeuronsDeviceProperties &allVerticesDevice)
    #copyHostToDevice(AllIZHNeuronsDeviceProperties &allVerticesDevice)
    #copyDeviceToHost(AllIZHNeuronsDeviceProperties &allVerticesDevice)
    #advanceNeuron(int index)
    #fire(int index)
    #createNeuron(int neuronIndex, Layout &layout)
    #setNeuronDefaults(int index)
    #initNeuronConstsFromParamValues(int neuronIndex, BGFLOAT deltaT) override
    #readNeuron(istream &input, int index)
    #writeNeuron(ostream &output, int index) const
}
class AllLIFNeurons {
    +printParameters() const override
    +serialize(Archive &archive)
    +advanceVertices(...)
    +Create()$ AllVertices *
    #advanceNeuron(int index)
    #fire(int index)
}
class AllSpikingNeurons {
    <<abstract>>
    +DeviceVector~ bool ~ hasFired_
    +vector~ EventBuffer~ uint64_t ~ ~ vertexEvents_
    +DeviceVector~ BGFLOAT ~ summationPoints_
    +setupVertices() override
    +clearSpikeCounts()
    +registerHistoryVariables() override
    +serialize(Archive &archive)
    +setAdvanceVerticesDeviceParams(AllEdges &synapses)
    +copyFromDevice() override
    +copyToDevice() override
    +integrateVertexInputs(...)
    +advanceVertices(...)
    +integrateVertexInputs(AllEdges &edges, EdgeIndexMap &edgeIndexMap)
    +getSpikeHistory(int index, int offIndex) uint64_t
    #clearDeviceSpikeCounts(...)
    #advanceNeuron(int index)=0*
    #fire(int index)
}
class AllVertices {
    <<abstract>>
    #log4cplus::Logger fileLogger_
    #log4cplus::Logger vertexLogger_
    +setupVertices()
    +printParameters() const
    +loadEpochInputs(uint64_t currentStep, uint64_t endStep)
    +loadEpochInputsToVertices(uint64_t currentStep, uint64_t endStep)
    +loadParameters()=0*
    +createAllVertices(Layout &layout)=0*
    +toString(int i) const =0* string
    +registerHistoryVariables()=0*
    +serialize(Archive &archive)
    +allocVerticesDeviceStruct()=0*
    +deleteVerticesDeviceStruct()=0*
    +clearVertexHistory(void *allVerticesDevice)=0*
    +copyToDevice()=0*
    +copyFromDevice()=0*
    +copyEpochInputsToDevice()
    +advanceVertices(...)*
    +setAdvanceVerticesDeviceParams(AllEdges &edges)=0*
    +integrateVertexInputs(...)*
    +getNumberOfVerticesNeedingDeviceNoise() const int
    +advanceVertices(...)*
    +integrateVertexInputs(AllEdges &edges, EdgeIndexMap &edgeIndexMap)=0*
}
class EventBuffer {
    +getBufferFront() const int
    +getBufferEnd() const int
    +getEpochStart() const int
    +getNumElementsInEpoch() const int
    +setBufferFront(int bufferFront)
    +setBufferEnd(int bufferEnd)
    +setEpochStart(int epochStart)
    +setNumElementsInEpoch(int numElementsInEpoch)
    +resize(int maxEvents)
    +operator[](int i) const T
    +serialize(Archive &archive)
}
AllVertices <|-- All911Vertices
AllSpikingNeurons <|-- AllIFNeurons
AllIFNeurons <|-- AllIZHNeurons
AllIFNeurons <|-- AllLIFNeurons
AllVertices <|-- AllSpikingNeurons
```
